app/Http/Controllers/ForumsController.php

    public function index(){
        //trae el ultimo al primero
        //$forums=Forum::latest()->paginate(5);
        $forums=Forum::with(['posts'])->paginate(10);
---
select * from `forums` limit 10 offset 0
select * from `posts` where `posts`.`forum_id` in ('1', '2')
select count(*) as aggregate from `forums`

    public function show($forums)
    {
       $foros=Forum::findOrFail($forums);
       $posts=$foros->posts()->with(['owner'])->paginate(2);
---
select * from `forums` where `forums`.`id` = '3' limit 1
select * from `forums` limit 2 offset 24
select * from `posts` where `posts`.`forum_id` = '3' and `posts`.`forum_id` is not null limit 2 offset 0
select count(*) as aggregate from `posts` where `posts`.`forum_id` = '3' and `posts`.`forum_id` is not null