app/Http/Controllers/ForumsController.php

    public function index(){
        //trae el ultimo al primero
        $forums=Forum::latest()->paginate(5);
---
select * from `forums` order by `created_at` desc limit 5 offset 0