app/Http/Controllers/PostsController.php

    public function show(Post $post)
    {
        $replices=$post->replies()->with(['author'])->paginate(2);
---
select * from `replies` where `replies`.`post_id` = '3' and `replies`.`post_id` is not null limit 2 offset 0
select count(*) as aggregate from `replies` where `replies`.`post_id` = '3' and `replies`.`post_id` is not null